W(1,:) = [2390000	2365000	2335000	2280000	2285000	2280000];
W(2,:) = [2490000	2465000	2435000	2380000	2385000	2380000];
W(3,:) = [2635000	2565000	2535000	2480000	2485000	2480000];
W(4,:) = [2910000	2810000	2695000	2580000	2585000	2580000];

color_point = ['ro', 'go', 'bo', 'ko'];
color_line = ['r-', 'g-', 'b-', 'k-'];
L = ["第1种家政服务起始员工数S1=100", "第1种家政服务起始员工数S1=120", "第1种家政服务起始员工数S1=140", "第1种家政服务起始员工数S1=160"];
for i = 1:4
    x = [0.10 0.15 0.20 0.30 0.40 0.50];
    plot(x, W(i,:), color_point(2*i-1:2*i)); hold on;

    xx = 0.05:0.005:0.55;
    yy_W = spline(x, W(i,:), xx);
    plot(xx, yy_W, color_line(2*i-1:2*i)); hold on;
    
    grid on;
    xlabel('第1种家政服务员工自动离职率r');
    ylabel('第1种家政服务年工资支出(元)');
    
end
legend('',L(1),'',L(2),'',L(3),'',L(4)); 