
year = 2000:2015;
population_local = [621.58	629.14	636.81	642.78	651.68	660.45	666.31	672.35	677.64	683.38	689.12	695.71	700.52	706.61	715.76	723.55];
population_male = [319.09	322.78	326.62	329.04	332.62	336.12	338.23	340.5	342.45	344.51	346.56	349.09	350.9	353.32	357.26	360.68];
population_female = [302.49	306.36	310.19	313.74	319.06	324.33	328.08	331.85	335.19	338.87	342.56	346.62	349.62	353.29	358.5	362.87];

plot(year,population_male,'bo-');
set(gca,'xtick',year);
hold on
plot(year,population_female,'ro-');
grid on;
%axis tight;
xlabel('时间(年)');
ylabel('人口数(万人)');
legend('男性人口','女性人口');
