clc

Y = [33815 33981 34004 34165 34212 34327 34344 34458 34498 34476 34483 34488 34513 34497 34511 34520 34507 34509 34521 34513 34515 34517 34519 34519 34521 34521 34523 34525 34525 34527];
T = [1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30];
% 线性化处理
for t = 1:30
    x(t) = exp(-t);
    y(t) = 1/Y(1,t);
end
% 计算并输出回归系数
c = ones(30,1);
X = [c,x];
B = inv(X'* X) * X' * y;
for i = 1:30
    % 计算回归拟合值
    z(i) = B(1,1) + B(2,1)*x(i);
    % 计算离差
    s(i) = y(i) - sum(y)/30;
    % 计算误差
    w(i) = z(i) - y(i);
end

% 计算离差平方和
S = s * s';
% 计算回归误差平方和
Q = w * w';
% 计算回归平方和U
U = S - Q;
% 计算并输出F检验值
F = 28 * U/Q;
% 计算线性回归模型的拟合值
for i = 1:30
    Y(i) = 1/(B(1,1) + B(2,1) * exp(-i));
end

plot(T,Y)